laminar_non_newtonian/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel powerLaw;

powerLawCoeffs
{
    // Limite superior para a viscosidade cinemática (baixa taxa de cisalhamento)
    nuMax       [0 2 -1 0 0 0 0] 1.5e-5;
    // Limite inferior para a viscosidade cinemática (alta taxa de cisalhamento)
    nuMin       [0 2 -1 0 0 0 0] 4e-6;
    k           [0 2 -1 0 0 0 0] 1.6e-2;
    n           [0 0 0 0 0 0 0] 0.7;
}

rho             rho [1 -3 0 0 0 0 0] 1050;


// ************************************************************************* //
